---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BooleanOperationsUtils
source: html/b90d16dd-1ebf-6d0e-c014-8ac35e6e8a90.htm
---
# BooleanOperationsUtils Members

Creates a new Solid which is the intersection of the input Solid with the half-space on the positive side of the given Plane. The positive side of the plane is the side to which Plane.Normal points.